Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ХотьЧтотоПроверить");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ХотьЧтотоПроверить() Экспорт

	Ч = Новый ЧтениеХранилищаКонфигурации;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cf");
	ПутьКФайлуХранилища = ОбъединитьПути(ТекущийКаталог(), "tests/depotv5/depot/1cv8ddb.1CD");
	Ч.ВыгрузитьВерсиюКонфигурации(ПутьКФайлуХранилища, ИмяВременногоФайла, 0);

	Ф = Новый Файл(ИмяВременногоФайла);
	юТест.ПроверитьИстину(Ф.Существует(), "Что-то выгрузилось");

КонецПроцедуры
